/* Errors returned by the device in the form of xml */
"Success" = "Powodzenie";
"TestInProgress" = "Trwa testowanie... Proszę czekać.";
"ErrorDeviceBusy" = "Urządzenie jest zajęte. Spróbuj ponownie później.";
"ErrorDuplicateDisplayName" = "Powtórzona nazwa wyświetlana lub lokalizacji. Przypisz inną nazwę i spróbuj ponownie.";
"ErrorEmptyEntry" = "Jedna z pozycji w ustawieniach wysłanych do urządzenia jest pusta. Sprawdź, czy wszystkie pozycje są poprawne, i spróbuj ponownie.";
"ErrorListFull" = "Brak dostępnego miejsca na dodanie tej pozycji. Usuń pozycję z urządzenia i spróbuj ponownie.";
"ErrorSettingNotTested" = "To ustawienie nie zostało przetestowane.";
"ErrorSystemFailure" = "Wystąpił błąd krytyczny. Spróbuj ponownie później.";
"ErrorNoMoreSpace" = "Maksymalny rozmiar załącznika wiadomości e-mail jest zbyt duży dla wybranego serwera. Wprowadź niższą wartość i spróbuj ponownie.";
"ErrorNoWritePermission" = "Wybrany folder nie ma ustawionego prawa do zapisu. Ustaw prawidłowe prawa dostępu do folderu i spróbuj ponownie.";
"ErrorConnectionFailed" = "Urządzenie nie może połączyć się z wybranym serwerem zdalnym. Sprawdź ustawienia serwera.";
"ErrorConnectionRefused" = "Nie można połączyć się z serwerem. Sprawdź, czy serwer jest włączony i czy działa.";
"ErrorServerNotFound" = "Urządzenie nie może pobrać nazwy hosta serwera. Sprawdź ustawienia serwera.";
"ErrorWrongCredentials" = "Serwer odrzucił poświadczenia użytkownika podczas uwierzytelniania. Wprowadź poprawne poświadczenia i spróbuj ponownie.";
"ErrorConnectionProblem" = "Wystąpił problem podczas łączenia z serwerem zdalnym. Sprawdź, czy serwer jest podłączony do sieci i czy działa.";
"ErrorProtocolNotSupported" = "Serwer zdalny używa protokołu, który nie jest obsługiwany.";
"ErrorInvalidFileOrDirectory" = "Określona ścieżka jest nieprawidłowa. Określ prawidłową ścieżkę i spróbuj ponownie.";
"ErrorInvalidFolderPath" = "Określona ścieżka jest nieprawidłowa. Określ prawidłową ścieżkę i spróbuj ponownie.";
"ErrorInvalidShare" = "Udostępniony folder jest nieprawidłowy. Wybierz inny udostępniony folder i spróbuj ponownie.";
"ErrorAuthenticationNeeded" = "Określony serwer wymaga uwierzytelnienia. Wprowadź poprawne poświadczenia, aby uzyskać dostęp do serwera, i spróbuj ponownie.";
"ErrorSecureConnectionNotSupported" = "Serwer nie obsługuje bezpiecznego połączenia. Usuń zaznaczenie pola wyboru Użyj SSL i spróbuj ponownie.";
"ErrorSenderInvalid" = "Adres e-mail nadawcy jest nieprawidłowy. Wprowadź prawidłowy adres e-mail nadawcy i spróbuj ponownie.";
"ErrorRecipientInvalid" = "Adres e-mail odbiorcy jest nieprawidłowy. Wprowadź prawidłowy adres e-mail odbiorcy i spróbuj ponownie.";
"ErrorServerError" = "Serwer zwrócił błąd. Nie można ukończyć żądanej operacji. Sprawdź, czy wprowadzone szczegóły serwera są prawidłowe.";
"ErrorInvalidServerName" = "Określony serwer jest nieprawidłowy. Wprowadź prawidłowy serwer SMTP i spróbuj ponownie.";

"404 Not Found" = "Nie można znaleźć urządzenia. Sprawdź, czy urządzenie jest połączone z siecią i czy jest włączone.";
"400 Bad Request" = "Nie można przetworzyć żądania z powodu błędu żądania. Spróbuj ponownie później.";

//error if the seed URL could not be obtained from the device
"COULD_NOT_GET_ACTUAL_URL" = "Urządzenie nie zwróciło poprawnego adresu URL. Poczekaj kilka minut i spróbuj ponownie.";

/* XML Data validation errors */
"Setting Error" = "Błąd brakujących lub nieprawidłowych danych";
"MISSING_FOLDER_SETTING" = "Brak niektórych szczegółów miejsc docelowych folderów. Wybierz folder, wprowadź nazwę użytkownika i hasło, a następnie spróbuj ponownie.";
"MISSING_EMAIL_SETTING" = "Brak niektórych szczegółów miejsc docelowych poczty e-mail. Wprowadź wszystkie ustawienia e-mail, a następnie spróbuj ponownie.";
"MISSING_SERVER_CREDENTIALS" = "Brak poświadczeń serwera. Wprowadź nazwę użytkownika i hasło, a następnie spróbuj ponownie.";
"MISSING_DISPLAY_NAME" = "Brak nazwiska nadawcy. Wprowadź nazwisko nadawcy, a następnie spróbuj ponownie.";
"MISSING_EMAIL_ADDRESS" = "Brak adresu e-mail. Wprowadź prawidłowy adres e-mail, a następnie spróbuj ponownie.";
"MISSING_SERVER" = "Brak serwera. Wprowadź serwer, a następnie spróbuj ponownie.";

"INVALID_PIN" = "Wprowadzony numer PIN jest nieprawidłowy. Numer powinien składać się z dokładnie 4 cyfr. Wprowadź prawidłowy numer PIN i spróbuj ponownie.";
"INVALID_SERVER_PORT" = "Wprowadzony numer portu serwera jest nieprawidłowy. Numer portu powinien zawierać się w zakresie od 1 do 65 535.";
"INVALID_ATTMT_SIZE" = "Wprowadzony maksymalny rozmiar załącznika jest nieprawidłowy. Powinien on zawierać się w zakresie od 1 do 9999. Wpisz -1, aby wybrać ustawienie automatycznego rozmiaru załącznika.";
"INVALID_DFADESTINATION" = "Wybrane miejsce docelowe faksu cyfrowego jest nieprawidłowe. Wybierz prawidłowe miejsce docelowe.";
"INVALID_POLLING_TIME" = "Wybrana wartość interwału odpytywania jest nieprawidłowa. Prawidłowe wartości to 5, 10, 15, 20, 30, 45 i 60. Wybierz poprawną wartość interwału odpytywania i spróbuj ponownie.";
"INVALID_DISPLAY_NAME" = "Wprowadzona nazwa nadawcy jest nieprawidłowa. Wprowadź nazwę nadawcy krótszą niż 25 znaków.";

/* Buttons */
"OK" = "OK";
"Cancel" = "Anuluj";

/* Other errors */
"GENERIC_ERROR_TITLE" = "Błąd";
"GENERIC_DEVICE_ERROR_TITLE" = "Błąd urządzenia";
"GENERIC_DEVICE_ERROR_DESC" = "Wystąpił nieznany błąd podczas komunikacji z urządzeniem. Spróbuj ponownie później.";
"XML_PARSING_ERROR" = "Urządzenie zwróciło nieprawidłowe dane. Poczekaj kilka minut, a następnie spróbuj ponownie.";
"DEVICE_COMMUNICATION_ERROR_DESC" = "Wystąpił błąd podczas komunikacji z urządzeniem. Sprawdź, czy urządzenie i komputer są podłączone do sieci i spróbuj ponownie.";

/*vhm: Added PML Related Errors*/

"DEVICE_NOT_FOUND_TITLE" = "Nie znaleziono urządzenia";
"DEVICE_NOT_FOUND_DESC" = "Wystąpił problem podczas komunikacji z urządzeniem. Upewnij się, że urządzenie jest włączone i prawidłowo podłączone, a następnie spróbuj ponownie.";

"PML_ERROR_TITLE" = "Błąd urządzenia";
"PML_ERROR_DESC1" = "Wystąpił problem podczas wprowadzania informacji do urządzenia. Upewnij się, że wprowadzane wartości są prawidłowe.";

"SETTING_REJECTED_TITLE" = "Ustawienia niezaakceptowane";
"SETTING_REJECTED_DESCRIPTION" = "Nie można wykonać konfiguracji, ponieważ urządzenie jest chronione przez hasło administratora. Użyj wbudowanego serwera WWW, aby usunąć hasło administratora. Więcej informacji można znaleźć w dokumentacji urządzenia.";

"GENERAL_DATA_MISSING_DESCRIPTION" = "Co najmniej jedno pole nie zawiera żadnych danych. Wypełnij wszystkie pola lub kliknij opcję Anuluj.";


//Device Door open error while printing the fax logs
"DOOR_OPEN_TITLE" = "Pokrywa jest otwarta";
"DOOR_OPEN_DESC" = "Drukarka nie może drukować, ponieważ pokrywa jest otwarta. Zamknij wszystkie pokrywy drukarki.";


//Device not ready error while printing the fax logs
"INCORRECT_STATE_TITLE" = "Wystąpił błąd drukarki";
"INCORRECT_STATE_DESC" = "Rozwiąż problem, który spowodował błąd, i spróbuj ponownie.";

//Device busy error while printing the fax logs
"DEVICE_BUSY_TITLE" = "Drukarka jest obecnie zajęta";
"DEVICE_BUSY_DESC" = "Zaczekaj, aż drukarka zakończy bieżące zadanie.";

//Error if the device's region code does not support fax blocking
"CALLER_ID_NOT_SUPPORTED_TITLE" = "Funkcja identyfikacji rozmówcy nie jest obsługiwana";
"CALLER_ID_NOT_SUPPORTED_DESC" = "Bieżące ustawienie kraju/regionu w urządzeniu nie obsługuje funkcji identyfikacji rozmówcy. Przy użyciu przedniego panelu urządzenia wybierz kraj/region obsługujący tę funkcję i spróbuj ponownie.";

//Error if black list entries are applied while device is processing the fax job
"COULD_NOT_APPLY_SETTINGS_TITLE" = "Nie udało się zastosować ustawień.";
"COULD_NOT_APPLY_SETTINGS_DESC" = "Sprawdź czy urządzenie jest online i czy jest podłączone, oraz czy nie przetwarza zadania faksowania.";


